In [1]:
pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.11/dist-packages (3.5.5)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.11/dist-packages (from pyspark) (0.10.9.7)

In [19]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import*

# initalize sparkContext
spark = SparkSession.builder.appName("PySpark_Tutorial").getOrCreate()
sc = spark.sparkContext
sc
# reda csv file
print("Sample data")
df=spark.read.csv("/content/sample_data/data1.csv.csv",header=True,inferSchema=True)
df.show(4)


print("Second data")
df1=spark.read.csv("/content/sample_data/data1.csv.csv",header=True,inferSchema=True)
df1.show(4)

# performe the joins on specific column based on csv files
print("Joins ")
print("Inner Join()")
df_inner_join=df.join(df1,df["id"]==df1["id"],"inner")
df_inner_join.show(4)

print("right join()")
df_right_join=df.join(df1,df["id"]==df1["id"],"right")
df_right_join.show(4)

print("Semi join()")
df_semi_join=df.join(df1,df["id"]==df1["id"],"leftsemi")
df_semi_join.show(4)

print("left join()")
df_left_join=df.join(df1,df["id"]==df1["id"],"left")
df_left_join.show(4)

print("anti join")
df_anti_join=df.join(df1,df["id"]==df1["id"],"leftanti")
df_anti_join.show(4)

print("cross join")
df_cross_join=df.join(df1,df["id"]==df1["id"],"cross")
df_cross_join.show(4)

Sample data
+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+
only showing top 4 rows

Second data
+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+
only showing top 4 rows

Joins
Inner Join()
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
only showing top 4 rows

right join()
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
only showing top 4 rows

Semi join()
+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+
only showing top 4 rows

left join()
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
only showing top 4 rows

anti join
+---+----+------+---+------+---------+-------+
| id|name|gender|age|salary|purchased|country|
+---+----+------+---+------+---------+-------+
+---+----+------+---+------+---------+-------+

cross join
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+---+-------+------+---+------+---------+---------+
only showing top 4 rows